Revit 2027 API
SpecTypeId.MomentScale Property
 Moment Scale, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MomentScale { get; }
Public Shared ReadOnly Property MomentScale As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MomentScale {
	ForgeTypeId^ get ();
}
static member MomentScale : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace